app/views/home/_blog.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
---

              <%= image_tag(post.user.avatar.url(:thumb),class:"round-image-50") %> &nbsp;&nbsp;&nbsp; By&nbsp;&nbsp;<b><%= post.user.firstname %></b>