app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.all