app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    # @posts = Post.all
    @posts = Post.all.paginate(page: params[:page], per_page: 2 )

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Ghost"], ["body", "<p>This is ghost..</p>\r\n"], ["created_at", "2016-11-19 02:27:54.606258"], ["updated_at", "2016-11-19 02:27:54.606258"]]
---
  def create
    # @post = Post.new(post_params)
    @post=current_user.posts.build(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 1]]
---
  def find_post
    @post = Post.find(params[:id])